Diplom1903/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

Diplom1903/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Diplom1903/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Добавление новых реквизитов и группы ГруппаПериод на форму элемента справочника
	Если Элементы.Найти("АбонентскаяПлата") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"));		
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Абонентская плата";
	КонецЕсли;
		
	Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));		
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Стоимость часа работы специалиста";
	КонецЕсли;
	
	ГруппаПериод = Элементы.Добавить("ГруппаПериод", Тип("ГруппаФормы"),ЭтотОбъект);
	ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПериод.ОтображатьЗаголовок = Ложь;
	ГруппаПериод.Отображение = ОтображениеОбычнойГруппы.Нет;

		
	Если Элементы.Найти("ДатаНачалаДействияДоговора") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ДатаНачалаДействияДоговора", Тип("ПолеФормы"), ГруппаПериод);		
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Период действия договора с";
	КонецЕсли;
		
	Если Элементы.Найти("ДатаОкончанияДействияДоговора") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), ГруппаПериод);		
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "по";
	КонецЕсли;
	
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");
	
	ВывестиЭлементыНаФорму(ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВывестиЭлементыНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиЭлементыНаФорму(Форма)
	
	//Настройка условия видимости новых элементов формы
	Если Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		Форма.Элементы.АбонентскаяПлата.Видимость = Истина;
		Форма.Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
		Форма.Элементы.ДатаНачалаДействияДоговора.Видимость = Истина;
		Форма.Элементы.ДатаОкончанияДействияДоговора.Видимость = Истина;
		
	Иначе
		
		Форма.Элементы.АбонентскаяПлата.Видимость = Ложь;
		Форма.Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
		Форма.Элементы.ДатаНачалаДействияДоговора.Видимость = Ложь;
		Форма.Элементы.ДатаОкончанияДействияДоговора.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
